---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightFailure
source: html/26f5122a-14f6-45ed-2de6-a850fae75e5b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightFailure Property

The column can't have zero height

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnZeroHeightFailure { get; }
```